To resolve the problem, here I commented out `resources`:

```
provider "aws" {region = "us-east-1"}

data "aws_iam_policy_document" "some_queue_role_policy" {
  statement {
    sid    = "CatalogServiceSQSRolePolicy"
    effect = "Allow"
    actions = [
      "sqs:GetQueueAttributes",
      "sqs:ListQueues",
      "sqs:ReceiveMessage",
      "sqs:ChangeMessageVisibility",
      "sqs:DeleteMessage",
      "sqs:GetQueueUrl",
      "sqs:SendMessage",
    ]
    # resources = [
    #   aws_sqs_queue.some_queue.arn
    # ]
    principals {
      type        = "AWS"
      identifiers = ["<iam role arn>"]
    }
  }
}

resource "aws_sqs_queue" "some_queue" {
  name                       = "some-queue"
  message_retention_seconds  = 86400
  visibility_timeout_seconds = 60
  sqs_managed_sse_enabled    = true
}

resource "aws_sqs_queue_policy" "some_queue_policy" {
  policy    = data.aws_iam_policy_document.some_queue_role_policy.json
  queue_url = aws_sqs_queue.some_queue.id
}
```

Logs indicating success:

```
❯ tf apply -auto-approve
data.aws_iam_policy_document.some_queue_role_policy: Reading...
data.aws_iam_policy_document.some_queue_role_policy: Read complete after 0s [id=2647914048]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_sqs_queue.some_queue will be created
  + resource "aws_sqs_queue" "some_queue" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = 0
      + max_message_size                  = 262144
      + message_retention_seconds         = 86400
      + name                              = "some-queue"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + sqs_managed_sse_enabled           = true
      + tags_all                          = (known after apply)
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 60
    }

  # aws_sqs_queue_policy.some_queue_policy will be created
  + resource "aws_sqs_queue_policy" "some_queue_policy" {
      + id        = (known after apply)
      + policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "sqs:SendMessage",
                          + "sqs:ReceiveMessage",
                          + "sqs:ListQueues",
                          + "sqs:GetQueueUrl",
                          + "sqs:GetQueueAttributes",
                          + "sqs:DeleteMessage",
                          + "sqs:ChangeMessageVisibility",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "<iam role arn>"
                        }
                      + Sid       = "SQSRolePolicy"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + queue_url = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.
aws_sqs_queue.some_queue: Creating...
aws_sqs_queue.some_queue: Still creating... [10s elapsed]
aws_sqs_queue.some_queue: Still creating... [20s elapsed]
aws_sqs_queue.some_queue: Still creating... [30s elapsed]
aws_sqs_queue.some_queue: Still creating... [40s elapsed]
aws_sqs_queue.some_queue: Still creating... [50s elapsed]
aws_sqs_queue.some_queue: Still creating... [1m0s elapsed]
aws_sqs_queue.some_queue: Still creating... [1m10s elapsed]
aws_sqs_queue.some_queue: Creation complete after 1m13s [id=https://sqs.us-east-1.amazonaws.com/<account id>/some-queue]
aws_sqs_queue_policy.some_queue_policy: Creating...
aws_sqs_queue_policy.some_queue_policy: Still creating... [10s elapsed]
aws_sqs_queue_policy.some_queue_policy: Still creating... [20s elapsed]
aws_sqs_queue_policy.some_queue_policy: Creation complete after 26s [id=https://sqs.us-east-1.amazonaws.com/<account id>/some-queue]

Apply complete! Resources: 2 added, 0 changed, 0 destroyed.
```